## Plan Result (shared-snowplow-consumer-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/242859)



<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * aws_sns_topic_subscription.SearchApiEventTopic-sns-subscription
* Update
  * aws_sqs_queue_policy.shared-snowplow-consumer-sns-dlq-policy
  * aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.SearchApiEventTopic-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "SearchApiEventTopic-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic"
    }

  # aws_sqs_queue_policy.shared-snowplow-consumer-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "shared-snowplow-consumer-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                    # (5 unchanged elements hidden)
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic",
                                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "shared-snowplow-consumer-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                    # (5 unchanged elements hidden)
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic",
                                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"6ae7d7f2-e5ca-4d40-969a-a5b5dfe86973","JobName":"shared-snowplow-consumer_infrastructure_plan_prod","PRNumber":666,"Program":"tfcmt","SHA1":"60c7b814c55974c931e738c0538db4205aa11207","Target":"shared-snowplow-consumer-cdk","Vars":{}} -->